RANS/3Dbuoyantjet_normal/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 293.15;

boundaryField
{
    pipe
    {
        type            zeroGradient;
    }

    nozzle
    {
        type            fixedValue;
        value           uniform 343.15;
    }

    ambient
    {
        type            inletOutlet;
        value           $internalField;
        inletValue      uniform 293.15;
    }

}


// ************************************************************************* //
